{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 834,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 835,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 836,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 837,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 838,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "E773": 0,
      "E595": 1,
      "E175": 2,
      "E791": 3,
      "E235": 4,
      "E285": 5,
      "E590": 6,
      "E483": 7,
      "E701": 8,
      "E330": 9,
      "E140": 10,
      "E719": 11,
      "T8": 12,
      "E178": 13,
      "E212": 14,
      "E799": 15,
      "E186": 16,
      "E537": 17,
      "E209": 18,
      "E464": 19,
      "E381": 20,
      "E104": 21,
      "E680": 22,
      "E233": 23,
      "E726": 24,
      "E222": 25,
      "E469": 26,
      "E738": 27,
      "E84": 28,
      "E707": 29,
      "E81": 30,
      "E473": 31,
      "E27": 32,
      "E389": 33,
      "E631": 34,
      "E564": 35,
      "E500": 36,
      "E34": 37,
      "E486": 38,
      "E292": 39,
      "E580": 40,
      "E713": 41,
      "E281": 42,
      "E30": 43,
      "E314": 44,
      "E712": 45,
      "E443": 46,
      "E18": 47,
      "E326": 48,
      "E496": 49,
      "E414": 50,
      "E260": 51,
      "E219": 52,
      "E529": 53,
      "E540": 54,
      "E167": 55,
      "E45": 56,
      ".": 57,
      "T12": 58,
      "E425": 59,
      "E755": 60,
      "E515": 61,
      "E378": 62,
      "E413": 63,
      "E602": 64,
      "E493": 65,
      "E93": 66,
      "E40": 67,
      "E113": 68,
      "E421": 69,
      "E386": 70,
      "E180": 71,
      "E547": 72,
      "E103": 73,
      "E614": 74,
      "E725": 75,
      "E724": 76,
      "T3": 77,
      "E750": 78,
      "E35": 79,
      "E129": 80,
      "E521": 81,
      "E781": 82,
      "E533": 83,
      "E393": 84,
      "E771": 85,
      "E536": 86,
      "E308": 87,
      "E517": 88,
      "E365": 89,
      "E295": 90,
      "E761": 91,
      "E287": 92,
      "E752": 93,
      "E690": 94,
      "E764": 95,
      "E592": 96,
      "E704": 97,
      "E589": 98,
      "E375": 99,
      "E234": 100,
      "E617": 101,
      "E36": 102,
      "E775": 103,
      "E165": 104,
      "E126": 105,
      "E422": 106,
      "E518": 107,
      "E438": 108,
      "E720": 109,
      "E548": 110,
      "E272": 111,
      "E806": 112,
      "E142": 113,
      "E349": 114,
      "E112": 115,
      "E431": 116,
      "E160": 117,
      "E276": 118,
      "E316": 119,
      "E131": 120,
      "E42": 121,
      "E225": 122,
      "E700": 123,
      "E403": 124,
      "E793": 125,
      "E808": 126,
      "E283": 127,
      "E25": 128,
      "E130": 129,
      "E78": 130,
      "E703": 131,
      "E185": 132,
      "E767": 133,
      "E787": 134,
      "E55": 135,
      "T19": 136,
      "E184": 137,
      "E645": 138,
      "E19": 139,
      "E733": 140,
      "E87": 141,
      "E706": 142,
      "E682": 143,
      "E472": 144,
      "E377": 145,
      "E86": 146,
      "E559": 147,
      "E148": 148,
      "E400": 149,
      "E33": 150,
      "E310": 151,
      "E122": 152,
      "E454": 153,
      "E683": 154,
      "E318": 155,
      "E633": 156,
      "E232": 157,
      "E85": 158,
      "E509": 159,
      "E230": 160,
      "E440": 161,
      "E404": 162,
      "E770": 163,
      "E734": 164,
      "E481": 165,
      "E453": 166,
      "E73": 167,
      "E571": 168,
      "E691": 169,
      "E792": 170,
      "E282": 171,
      "E66": 172,
      "E410": 173,
      "E532": 174,
      "E37": 175,
      "E69": 176,
      "E120": 177,
      "E301": 178,
      "E313": 179,
      "E681": 180,
      "E630": 181,
      "E551": 182,
      "E408": 183,
      "E555": 184,
      "E363": 185,
      "T10": 186,
      "E289": 187,
      "E552": 188,
      "E456": 189,
      "E366": 190,
      "E174": 191,
      "E402": 192,
      "E666": 193,
      "E494": 194,
      "E12": 195,
      "E557": 196,
      "E716": 197,
      "E159": 198,
      "E388": 199,
      "E757": 200,
      "E243": 201,
      "E383": 202,
      "E432": 203,
      "E661": 204,
      "E251": 205,
      "E162": 206,
      "E293": 207,
      "E398": 208,
      "E203": 209,
      "E629": 210,
      "E249": 211,
      "E7": 212,
      "E779": 213,
      "E811": 214,
      "E267": 215,
      "E340": 216,
      "E754": 217,
      "E449": 218,
      "E714": 219,
      "?": 220,
      "E202": 221,
      "E134": 222,
      "E759": 223,
      "E692": 224,
      "E70": 225,
      "E322": 226,
      "E732": 227,
      "E604": 228,
      "E356": 229,
      "E128": 230,
      "E470": 231,
      "E735": 232,
      "E306": 233,
      "E663": 234,
      "E444": 235,
      "E445": 236,
      "E715": 237,
      "E116": 238,
      "E336": 239,
      "E417": 240,
      "E157": 241,
      "E38": 242,
      "E673": 243,
      "E394": 244,
      "E583": 245,
      "E83": 246,
      "E200": 247,
      "E697": 248,
      "E229": 249,
      "E392": 250,
      "E480": 251,
      "E801": 252,
      "E255": 253,
      "E135": 254,
      "E441": 255,
      "E803": 256,
      "E460": 257,
      "E166": 258,
      "E642": 259,
      "E437": 260,
      "E100": 261,
      "E778": 262,
      "E270": 263,
      "E758": 264,
      "E239": 265,
      "E784": 266,
      "E746": 267,
      "E542": 268,
      "E145": 269,
      "E268": 270,
      "E370": 271,
      "E380": 272,
      "E442": 273,
      "E409": 274,
      "E762": 275,
      "E327": 276,
      "E698": 277,
      "E687": 278,
      "E505": 279,
      "E487": 280,
      "E17": 281,
      "T5": 282,
      "E671": 283,
      "E204": 284,
      "E4": 285,
      "E206": 286,
      "E48": 287,
      "E26": 288,
      "E501": 289,
      "E605": 290,
      "E395": 291,
      "E647": 292,
      "E621": 293,
      "E465": 294,
      "E208": 295,
      "E477": 296,
      "E108": 297,
      "E227": 298,
      "E196": 299,
      "E266": 300,
      "E127": 301,
      "E623": 302,
      "E702": 303,
      "E379": 304,
      "E323": 305,
      "T6": 306,
      "E221": 307,
      "E561": 308,
      "E269": 309,
      "E24": 310,
      "E307": 311,
      "E434": 312,
      "E789": 313,
      "E659": 314,
      "E325": 315,
      "E507": 316,
      "E139": 317,
      "E68": 318,
      "E303": 319,
      "E618": 320,
      "E176": 321,
      "E124": 322,
      "E740": 323,
      "E539": 324,
      "E367": 325,
      "E743": 326,
      "E101": 327,
      "E615": 328,
      "E154": 329,
      "E299": 330,
      "E65": 331,
      "E329": 332,
      "E156": 333,
      "E676": 334,
      "E439": 335,
      "E13": 336,
      "E88": 337,
      "E58": 338,
      "E626": 339,
      "E776": 340,
      "E291": 341,
      "E644": 342,
      "E320": 343,
      "E132": 344,
      "E10": 345,
      "E151": 346,
      "E405": 347,
      "E420": 348,
      "E562": 349,
      "E622": 350,
      "E324": 351,
      "E627": 352,
      "E237": 353,
      "E76": 354,
      "E576": 355,
      "E514": 356,
      "E610": 357,
      "E82": 358,
      "E67": 359,
      "E169": 360,
      "E485": 361,
      "E427": 362,
      "T9": 363,
      "E317": 364,
      "E612": 365,
      "E769": 366,
      "E256": 367,
      "E43": 368,
      "E418": 369,
      "E164": 370,
      "T1": 371,
      "E492": 372,
      "E446": 373,
      "E545": 374,
      "E588": 375,
      "T0": 376,
      "E632": 377,
      "T14": 378,
      "E688": 379,
      "E333": 380,
      "E250": 381,
      "E214": 382,
      "E149": 383,
      "E710": 384,
      "E171": 385,
      "E672": 386,
      "E371": 387,
      "E795": 388,
      "E46": 389,
      "E474": 390,
      "E467": 391,
      "E488": 392,
      "E611": 393,
      "E280": 394,
      "E223": 395,
      "E511": 396,
      "E72": 397,
      "E655": 398,
      "E741": 399,
      "E387": 400,
      "E763": 401,
      "E197": 402,
      "E711": 403,
      "E321": 404,
      "E158": 405,
      "E574": 406,
      "E696": 407,
      "E796": 408,
      "E187": 409,
      "E745": 410,
      "E362": 411,
      "E810": 412,
      "E137": 413,
      "E479": 414,
      "E753": 415,
      "E357": 416,
      "E358": 417,
      "E729": 418,
      "E646": 419,
      "E406": 420,
      "E74": 421,
      "E652": 422,
      "E596": 423,
      "E415": 424,
      "E424": 425,
      "E549": 426,
      "E570": 427,
      "E44": 428,
      "E8": 429,
      "E105": 430,
      "E368": 431,
      "E568": 432,
      "E695": 433,
      "T13": 434,
      "E603": 435,
      "E585": 436,
      "E193": 437,
      "E32": 438,
      "E252": 439,
      "E721": 440,
      "E578": 441,
      "E288": 442,
      "E163": 443,
      "E304": 444,
      "E339": 445,
      "E504": 446,
      "E423": 447,
      "E311": 448,
      "E347": 449,
      "E153": 450,
      "E660": 451,
      "E619": 452,
      "E668": 453,
      "E497": 454,
      "E119": 455,
      "E253": 456,
      "E651": 457,
      "E396": 458,
      "E436": 459,
      "E512": 460,
      "E49": 461,
      "E5": 462,
      "E331": 463,
      "E727": 464,
      "E429": 465,
      "E634": 466,
      "E125": 467,
      "E412": 468,
      "E290": 469,
      "E236": 470,
      "E513": 471,
      "E300": 472,
      "E297": 473,
      "E744": 474,
      "E665": 475,
      "E56": 476,
      "E15": 477,
      "E747": 478,
      "E231": 479,
      "T18": 480,
      "E433": 481,
      "E2": 482,
      "E636": 483,
      "E535": 484,
      "E718": 485,
      "E90": 486,
      "E455": 487,
      "E546": 488,
      "E179": 489,
      "E315": 490,
      "E448": 491,
      "E463": 492,
      "E520": 493,
      "E342": 494,
      "E341": 495,
      "E670": 496,
      "E199": 497,
      "E355": 498,
      "E685": 499,
      "E192": 500,
      "E579": 501,
      "E373": 502,
      "E79": 503,
      "E228": 504,
      "E372": 505,
      "E147": 506,
      "E534": 507,
      "E502": 508,
      "E348": 509,
      "E215": 510,
      "E694": 511,
      "E118": 512,
      "E181": 513,
      "E794": 514,
      "E117": 515,
      "E450": 516,
      "E478": 517,
      "E173": 518,
      "E519": 519,
      "E800": 520,
      "E275": 521,
      "E98": 522,
      "E241": 523,
      "E730": 524,
      "E188": 525,
      "E416": 526,
      "E550": 527,
      "E14": 528,
      "E653": 529,
      "E506": 530,
      "E649": 531,
      "E259": 532,
      "E102": 533,
      "E77": 534,
      "E742": 535,
      "E675": 536,
      "E189": 537,
      "E657": 538,
      "E635": 539,
      "E628": 540,
      "E462": 541,
      "E471": 542,
      "E220": 543,
      "E482": 544,
      "E679": 545,
      "E766": 546,
      "E80": 547,
      "E274": 548,
      "E334": 549,
      "E265": 550,
      "E591": 551,
      "E61": 552,
      "E351": 553,
      "E121": 554,
      "E731": 555,
      "E63": 556,
      "E155": 557,
      "E22": 558,
      "E226": 559,
      "E780": 560,
      "E523": 561,
      "E526": 562,
      "E786": 563,
      "E705": 564,
      "T17": 565,
      "E337": 566,
      "E717": 567,
      "E16": 568,
      "E92": 569,
      "E106": 570,
      "E584": 571,
      "E20": 572,
      "E693": 573,
      "E245": 574,
      "E397": 575,
      "E739": 576,
      "E567": 577,
      "E359": 578,
      "E639": 579,
      "E168": 580,
      "E71": 581,
      "E525": 582,
      "E459": 583,
      "E240": 584,
      "E51": 585,
      "E656": 586,
      "E782": 587,
      "E565": 588,
      "E75": 589,
      "E699": 590,
      "E572": 591,
      "E95": 592,
      "E144": 593,
      "E790": 594,
      "E594": 595,
      "E581": 596,
      "E772": 597,
      "E812": 598,
      "E788": 599,
      "E805": 600,
      "E664": 601,
      "E749": 602,
      "E170": 603,
      "E364": 604,
      "E573": 605,
      "E344": 606,
      "E172": 607,
      "E91": 608,
      "E582": 609,
      "E305": 610,
      "E111": 611,
      "E152": 612,
      "E374": 613,
      "E296": 614,
      "E737": 615,
      "E161": 616,
      "E516": 617,
      "E343": 618,
      "E399": 619,
      "E748": 620,
      "E201": 621,
      "E499": 622,
      "E807": 623,
      "E262": 624,
      "E302": 625,
      "T4": 626,
      "E401": 627,
      "E765": 628,
      "E641": 629,
      "E616": 630,
      "E674": 631,
      "E64": 632,
      "E114": 633,
      "E136": 634,
      "E3": 635,
      "E407": 636,
      "E527": 637,
      "E620": 638,
      "E177": 639,
      "E328": 640,
      "E541": 641,
      "E385": 642,
      "E99": 643,
      "E143": 644,
      "E110": 645,
      "E141": 646,
      "E28": 647,
      "E760": 648,
      "E21": 649,
      "E768": 650,
      "E751": 651,
      "T16": 652,
      "E62": 653,
      "E207": 654,
      "T15": 655,
      "E384": 656,
      "E553": 657,
      "E59": 658,
      "E246": 659,
      "E123": 660,
      "E510": 661,
      "E709": 662,
      "E376": 663,
      "E640": 664,
      "E484": 665,
      "E411": 666,
      "E263": 667,
      "E195": 668,
      "E736": 669,
      "E777": 670,
      "E684": 671,
      "E468": 672,
      "E278": 673,
      "E447": 674,
      "E350": 675,
      "E254": 676,
      "E495": 677,
      "E809": 678,
      "E783": 679,
      "E107": 680,
      "E352": 681,
      "E0": 682,
      "E597": 683,
      "E198": 684,
      "E638": 685,
      "E360": 686,
      "E217": 687,
      "E428": 688,
      "E216": 689,
      "E804": 690,
      "E785": 691,
      "E213": 692,
      "E182": 693,
      "E797": 694,
      "E273": 695,
      "E361": 696,
      "E31": 697,
      "E457": 698,
      "E560": 699,
      "E708": 700,
      "E382": 701,
      "E658": 702,
      "E538": 703,
      "E606": 704,
      "E391": 705,
      "E205": 706,
      "E194": 707,
      "E345": 708,
      "E419": 709,
      "E476": 710,
      "E563": 711,
      "E689": 712,
      "E23": 713,
      "E94": 714,
      "E97": 715,
      "E190": 716,
      "E558": 717,
      "E643": 718,
      "E498": 719,
      "E109": 720,
      "E244": 721,
      "E390": 722,
      "E575": 723,
      "E723": 724,
      "E435": 725,
      "E50": 726,
      "E598": 727,
      "E678": 728,
      "E258": 729,
      "E624": 730,
      "E601": 731,
      "E452": 732,
      "E332": 733,
      "E294": 734,
      "E277": 735,
      "E600": 736,
      "E264": 737,
      "E224": 738,
      "E489": 739,
      "E335": 740,
      "E298": 741,
      "E257": 742,
      "E802": 743,
      "E218": 744,
      "E353": 745,
      "T11": 746,
      "E138": 747,
      "E637": 748,
      "E6": 749,
      "E461": 750,
      "E593": 751,
      "E146": 752,
      "E798": 753,
      "E613": 754,
      "E248": 755,
      "E279": 756,
      "E309": 757,
      "E242": 758,
      "E669": 759,
      "E338": 760,
      "E426": 761,
      "E608": 762,
      "E41": 763,
      "E354": 764,
      "E271": 765,
      "E543": 766,
      "E1": 767,
      "E60": 768,
      "E96": 769,
      "E183": 770,
      "E587": 771,
      "E607": 772,
      "E667": 773,
      "E11": 774,
      "E150": 775,
      "E284": 776,
      "E586": 777,
      "E369": 778,
      "E569": 779,
      "E29": 780,
      "E54": 781,
      "E39": 782,
      "E261": 783,
      "E458": 784,
      "E53": 785,
      "E662": 786,
      "E466": 787,
      "E238": 788,
      "E312": 789,
      "E554": 790,
      "E686": 791,
      "E722": 792,
      "E115": 793,
      "E503": 794,
      "E609": 795,
      "E490": 796,
      "E247": 797,
      "E211": 798,
      "E556": 799,
      "E728": 800,
      "E491": 801,
      "E52": 802,
      "E522": 803,
      "T2": 804,
      "E9": 805,
      "E319": 806,
      "E89": 807,
      "E57": 808,
      "E756": 809,
      "E648": 810,
      "E530": 811,
      "E475": 812,
      "E346": 813,
      "E544": 814,
      "E774": 815,
      "E133": 816,
      "E508": 817,
      "E430": 818,
      "E599": 819,
      "E531": 820,
      "E528": 821,
      "E524": 822,
      "E650": 823,
      "E577": 824,
      "E677": 825,
      "E566": 826,
      "E625": 827,
      "E191": 828,
      "E47": 829,
      "E210": 830,
      "E451": 831,
      "E654": 832,
      "E286": 833
    },
    "unk_token": "[UNK]"
  }
}